backend/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        recipes = Recipe.all

INSERT INTO "recipes" DEFAULT VALUES
---
    def create
        recipe = Recipe.new
            if recipe.save